mtosi_1.1/xml/notifications/alarm.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns="tmf854.v1" xmlns:nt1="vendor.v1" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="vendor.v1 ../vendorSchema/vendorDefinitions.xsd tmf854.v1 ../../xsd/common/header.xsd tmf854.v1 ../../xsd/interfaces/InventoryRetrieval.xsd http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Header>
    <header tmf854Version="1.0">
      <activityName>notify</activityName>
      <msgName>notify</msgName>
      <msgType>NOTIFICATION</msgType>
      <senderURI>/MTOSI/EMS01</senderURI>
      <destinationURI>/MTOSI/FaultOS</destinationURI>
      <communicationPattern>Notification</communicationPattern>
      <communicationStyle>MSG</communicationStyle>
      <timestamp>20051004140305</timestamp>
    </header>
  </soap:Header>
  <soap:Body>
    <notify tmf854Version="1.0">
      <topic>Fault</topic>
      <message>
        <Alarm>
          <eventInfo>
            <notificationId>0001239</notificationId>
            <objectName>
              <mdNm>A_DomainName</mdNm>
              <meNm>A_MEName</meNm>
              <eqNm>A_EQPName</eqNm>
            </objectName>
            <objectType>OT_EQUIPMENT</objectType>
            <osTime>20041106210627.3</osTime>
            <neTime>20041106210615.0</neTime>
            <edgePointRelated>false</edgePointRelated>
          </eventInfo>
          <isClearable>false</isClearable>
          <layerRate>LR_Line_OC192_STS192_and_MS_STM64</layerRate>
          <perceivedSeverity>PS_MAJOR</perceivedSeverity>
          <serviceAffecting>SA_SERVICE_AFFECTING</serviceAffecting>
          <rcaiIndicator>false</rcaiIndicator>
          <aliasNameList>
            <alias>
              <aliasName>nativeName</aliasName>
              <aliasValue>nativeValue</aliasValue>
            </alias>
          </aliasNameList>
          <probableCause>
            <type>AIS</type>
          </probableCause>
          <nativeProbableCause>nativeProbableCause</nativeProbableCause>
          <additionalText>additionalText</additionalText>
          <acknowledgeIndication>AI_EVENT_UNACKNOWLEDGED</acknowledgeIndication>
          <X733_EventType>X733_eventType</X733_EventType>
          <X733_SpecificProblems>
            <specificProblem>specificProblem1</specificProblem>
            <specificProblem>specificProblem2</specificProblem>
          </X733_SpecificProblems>
          <affectedTPList>
            <name>
              <mdNm>A_DomainName</mdNm>
              <meNm>A_MEName</meNm>
              <ptpNm>A_PTPName</ptpNm>
            </name>
          </affectedTPList>
          <X733_BackedUpStatus>X733_BackedUpStatus</X733_BackedUpStatus>
          <X733_BackUpObject>
            <mdNm>A_DomainName</mdNm>
            <meNm>A_MEName</meNm>
            <eqNm>A_EQName</eqNm>
          </X733_BackUpObject>
          <X733_TrendIndication>X733_TrendIndication</X733_TrendIndication>
          <X733_CorrelatedNotifications>
            <correlatedNotifications>
              <name>
                <mdNm>A_DomainName</mdNm>
                <meNm>A_MEName</meNm>
                <eqNm>A_EQName</eqNm>
              </name>
              <notifIDs>
                <notificationId>notif_id1</notificationId>
                <notificationId>notif_id2</notificationId>
              </notifIDs>
            </correlatedNotifications>
          </X733_CorrelatedNotifications>
          <X733_MonitoredAttributes>
            <productName>product_name</productName>
            <aliasNameList>
              <alias>
                <aliasName>FirstAliasName</aliasName>
                <aliasValue>FirstAlaisValue</aliasValue>
              </alias>
            </aliasNameList>
          </X733_MonitoredAttributes>
          <X733_ProposedRepairActions>
            <proposedRepairAction>proposedRepairAction1</proposedRepairAction>
            <proposedRepairAction>proposedRepairAction2</proposedRepairAction>
          </X733_ProposedRepairActions>
          <vendorExtensions/>
        </Alarm>
      </message>
    </notify>
  </soap:Body>
</soap:Envelope>
